c5/src/Documents/Hiring/Hiring.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Hiring</name>
  <registerRecords>InformationRegister.Employees</registerRecords>
  <registerRecords>InformationRegister.Personnel</registerRecords>
  <registerRecords>InformationRegister.Employment</registerRecords>
  <registerRecords>InformationRegister.EmployeeRates</registerRecords>
  <registerRecords>InformationRegister.SalaryInHand</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Additions</name>
    <attributes>
      <name>Compensation</name>
      <type>
        <types>ChartOfCalculationTypesRef.Compensations</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Employees</name>
    <attributes>
      <name>Compensation</name>
      <type>
        <types>ChartOfCalculationTypesRef.Compensations</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>DateEnd</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DateStart</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Department</name>
      <type>
        <types>CatalogRef.Departments</types>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Employment</name>
      <type>
        <types>EnumRef.Employment</types>
      </type>
    </attributes>
    <attributes>
      <name>Expenses</name>
      <type>
        <types>CatalogRef.ExpenseMethods</types>
      </type>
    </attributes>
    <attributes>
      <name>Individual</name>
      <type>
        <types>CatalogRef.Individuals</types>
      </type>
    </attributes>
    <attributes>
      <name>InHand</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Position</name>
      <type>
        <types>CatalogRef.Positions</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Schedule</name>
      <type>
        <types>CatalogRef.Schedules</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Documents/EmployeesTransfer/EmployeesTransfer.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>EmployeesTransfer</name>
  <registerRecords>InformationRegister.Personnel</registerRecords>
  <registerRecords>InformationRegister.EmployeeRates</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Additions</name>
    <attributes>
      <name>Action</name>
      <type>
        <types>EnumRef.Changes</types>
      </type>
    </attributes>
    <attributes>
      <name>Compensation</name>
      <type>
        <types>ChartOfCalculationTypesRef.Compensations</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Employees</name>
    <attributes>
      <name>Action</name>
      <type>
        <types>EnumRef.Changes</types>
      </type>
    </attributes>
    <attributes>
      <name>Compensation</name>
      <type>
        <types>ChartOfCalculationTypesRef.Compensations</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Department</name>
      <type>
        <types>CatalogRef.Departments</types>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Expenses</name>
      <type>
        <types>CatalogRef.ExpenseMethods</types>
      </type>
    </attributes>
    <attributes>
      <name>Individual</name>
      <type>
        <types>CatalogRef.Individuals</types>
      </type>
    </attributes>
    <attributes>
      <name>Position</name>
      <type>
        <types>CatalogRef.Positions</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Schedule</name>
      <type>
        <types>CatalogRef.Schedules</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/CommonModules/HiringForm/Module.bsl
&AtClient
Procedure LoadRow ( Form, Params ) export
	
	object = Form.Object;
	tableRow = Form.TableRow;
	FillPropertyValues ( tableRow, Params.Value );
	table = object.Additions;
	rows = table.FindRows ( new Structure ( "Employee", tableRow.Employee ) );
	for each row in rows do
		table.Delete ( row );
	enddo; 
	for each row in Params.Additions do
		newRow = table.Add ();
		FillPropertyValues ( newRow, row );
	enddo; 
	filterAdditions ( Form );
	
EndProcedure 

&AtClient
Procedure filterAdditions ( Form )
	
	items = Form.Items;
	tableRow = Form.TableRow;
	if ( tableRow = undefined ) then
		items.Additions.RowFilter = undefined;
	else
		filter = new Structure ( "Employee", tableRow.Employee );
		items.Additions.RowFilter = new FixedStructure ( filter );
	endif; 
	
EndProcedure 

&AtClient
Procedure EditRow ( Form, NewRow = false ) export
	
	if ( Form.TableRow = undefined ) then
		return;
	endif; 
	p = new Structure ();
	object = Form.Object;
	p.Insert ( "Company", object.Company );
	p.Insert ( "row", NewRow );
	if ( TypeOf ( object.Ref ) = Type ( "DocumentRef.Hiring" ) ) then
		name = "Document.Hiring.Form.Row";
	else
		name = "Document.EmployeesTransfer.Form.Row";
	endif; 
	OpenForm ( name, p, Form, , , , new NotifyDescription ( "RecordClosed", ThisObject, Form ) );
	
EndProcedure 

&AtClient
Procedure RecordClosed ( Result, Form ) export
	
	if ( Result = undefined ) then
		return;
	endif;
	HiringForm.LoadRow ( Form, Result );

EndProcedure 

&AtClient
Procedure OnActivateRow ( Form, Item ) export
	
	Form.TableRow = Item.CurrentData;
	filterAdditions ( Form );
	
EndProcedure

&AtClient
Procedure CleanAdditions ( Form ) export
	
	object = Form.Object;
	table = object.Additions;
	rows = table.FindRows ( new Structure ( "Employee", Form.TableRow.Employee ) );
	for each row in rows do
		table.Delete ( row );
	enddo; 
	
EndProcedure 

&AtClient
Procedure SetIndividual ( TableRow ) export
	
	employee = TableRow.Employee;
	if ( employee.IsEmpty () ) then
		TableRow.Individual = undefined;
	else
		TableRow.Individual = DF.Pick ( employee, "Individual" );
	endif; 
	
EndProcedure 

&AtServer
Function CheckDoubles ( Object ) export
	
	doubles = Collections.GetDoubles ( Object.Employees, "Employee" );
	if ( doubles.Count () > 0 ) then
		for each row in doubles do
			Output.EmployeeDuplicated ( , Output.Row ( "Employees", row.LineNumber, "Employee" ) );
		enddo; 
		return false;
	endif; 
	return true;
	
EndFunction
